IDEA Open Model
PatchLoad Class
Compatible with IDEA StatiCa 20.1
 Representation of patch load in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.PatchDevice
 IdeaRS.OpenModel.Detail.PatchLoad
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class PatchLoad : PatchDevice
Public Class PatchLoad
	Inherits PatchDevice
The PatchLoad type exposes the following members.
Constructors
Name | Description
PatchLoad
 Constructor
Top
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
 (Inherited from PatchDevice.)
Id
 Element Id
 (Inherited from OpenElementId.)
MasterComponent
 Master component
 (Inherited from PatchDevice.)
MasterPoint
 Master point 0 - 9
 (Inherited from PatchDevice.)
Position
 Offset between MasterPoint and patch support/load
 (Inherited from PatchDevice.)
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace